# Time-Sensitive Interview Task

In [42]:
import numpy as np
import pandas as pd
from scipy import stats

import warnings
warnings.filterwarnings("ignore")

In [43]:
import seaborn as sns
import matplotlib.pyplot as plt
from pandas.plotting import register_matplotlib_converters
from pylab import rcParams
sns.set_style("darkgrid")

In [44]:
df_sales = pd.read_csv("sales_082020.csv")
df_sales.head()

,buyer_id,buyer_country,seller_id,seller_country,product_code,category,brand,currency,price,date
0,qzpjsi9t0o,GB,6oufpaot,GB,ydecnydr6obf,Dresses,NaN,GBP,19.11,2020-08-03
1,o79pns1qwo,GB,50xki2yg,GB,38chj507o6h2,Outerwear,Adidas Originals,GBP,15.92,2020-08-09
2,sjgbjdkhqx,GB,50xki2yg,GB,i9ynyxj5tdp8,Tops - Mens,NaN,GBP,6.37,2020-08-07
3,o79pns1qwo,GB,s0p322hh,GB,t50xe7moye8v,Tops - Mens,Berghaus,GBP,25.27,2020-08-09
4,o79pns1qwo,GB,dpkx192v,GB,hp4r9bjq68af,Bottoms - Womens,NaN,GBP,8.90,2020-08-09

In [45]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 237671 entries, 0 to 237670
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   buyer_id        237671 non-null  object
 1   buyer_country   237671 non-null  object
 2   seller_id       237671 non-null  object
 3   seller_country  237671 non-null  object
 4   product_code    237671 non-null  object
 5   category        237655 non-null  object
 6   brand           119330 non-null  object
 7   currency        237671 non-null  object
 8   price           237671 non-null  float64
 9   date            237671 non-null  object
dtypes: float64(1), object(9)
memory usage: 18.1+ MB

In [46]:
df_cur = pd.read_csv("currency_rates_082020_EUR.csv")
df_cur.head()

  currency      date  rate
0      EUR  8/1/2020   1.0
1      EUR  8/2/2020   1.0
2      EUR  8/3/2020   1.0
3      EUR  8/4/2020   1.0
4      EUR  8/5/2020   1.0

In [47]:
df_cur.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 220 entries, 0 to 219
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   currency  220 non-null    object
 1   date      220 non-null    object
 2   rate      220 non-null    float64
dtypes: float64(1), object(2)
memory usage: 5.3+ KB

In [48]:
df_sales1 = df_sales.copy()

In [49]:
df_sales1.date = pd.to_datetime(df_sales1.date)

In [50]:
df_cur1 = df_cur.copy()

In [51]:
df_cur1.date = pd.to_datetime(df_cur1.date)

In [52]:
df_new = pd.merge(df_sales1, df_cur1, how = 'inner', on = ["currency","date"])
df_new.head()

,buyer_id,buyer_country,seller_id,seller_country,product_code,category,brand,currency,price,date,rate
0,qzpjsi9t0o,GB,6oufpaot,GB,ydecnydr6obf,Dresses,NaN,GBP,19.11,2020-08-03,0.89935
1,rd209r8c7c,GB,9p2ansc9,GB,wpxxf59cq7pc,Outerwear - Mens,Adidas Originals,GBP,24.91,2020-08-03,0.89935
2,pqbcrl8azx,GB,r9zmzem8,GB,ua9mmn86wsqy,Tops - Womens,NaN,GBP,19.31,2020-08-03,0.89935
3,j5en1rwmxp,GB,3o2nz88r,GB,tduo2uy8iszl,Bottoms - Womens,Urban Outfitters,GBP,16.98,2020-08-03,0.89935
4,kjdezxeh1l,GB,7g56ublf,GB,39o00tcu89zq,Other,NaN,GBP,2.85,2020-08-03,0.89935

In [53]:
df_new['total'] = df_new.price / df_new["rate"]
df_new.head()

,buyer_id,buyer_country,seller_id,seller_country,product_code,category,brand,currency,price,date,rate,total
0,qzpjsi9t0o,GB,6oufpaot,GB,ydecnydr6obf,Dresses,NaN,GBP,19.11,2020-08-03,0.89935,21.248680
1,rd209r8c7c,GB,9p2ansc9,GB,wpxxf59cq7pc,Outerwear - Mens,Adidas Originals,GBP,24.91,2020-08-03,0.89935,27.697782
2,pqbcrl8azx,GB,r9zmzem8,GB,ua9mmn86wsqy,Tops - Womens,NaN,GBP,19.31,2020-08-03,0.89935,21.471062
3,j5en1rwmxp,GB,3o2nz88r,GB,tduo2uy8iszl,Bottoms - Womens,Urban Outfitters,GBP,16.98,2020-08-03,0.89935,18.880302
4,kjdezxeh1l,GB,7g56ublf,GB,39o00tcu89zq,Other,NaN,GBP,2.85,2020-08-03,0.89935,3.168955

#### 1. Which country made the highest percentage of international purchases?

In [165]:
df_new.head(1)

,buyer_id,buyer_country,seller_id,seller_country,product_code,category,brand,currency,price,date,rate,total
0,qzpjsi9t0o,GB,6oufpaot,GB,ydecnydr6obf,Dresses,NaN,GBP,19.11,2020-08-03,0.89935,21.24868

In [163]:
((df_new.groupby("buyer_country")["total"].sum()/df_new["total"].sum()) * 100).round(2).sort_values(ascending=False).head(1)

buyer_country
GB    55.3
Name: total, dtype: float64

In [162]:
((df_int.groupby("buyer_country")["total"].sum()/df_int["total"].sum()) * 100).round(2).sort_values(ascending=False).head(1)

buyer_country
RoW    29.32
Name: total, dtype: float64

#### 2. Which day has the highest value of purchases?

In [164]:
df_new.head(1)

,buyer_id,buyer_country,seller_id,seller_country,product_code,category,brand,currency,price,date,rate,total
0,qzpjsi9t0o,GB,6oufpaot,GB,ydecnydr6obf,Dresses,NaN,GBP,19.11,2020-08-03,0.89935,21.24868

In [94]:
df_new.loc[df_new["total"].idxmax()]['date']

Timestamp('2020-08-03 00:00:00')

In [114]:
df_new.sort_values(by='total', ascending=False)[:1]['date']

22022   2020-08-03
Name: date, dtype: datetime64[ns]

#### 3. Which category has 2,324 transactions on 7 August?

In [202]:
df_7Aug = df_new[(df_new['date']=='2020-08-07')].groupby('category').count()
df_7Aug.reset_index(inplace=True)
df_7Aug[df_7Aug['buyer_id']==2324]['category']

9    Jewellery
Name: category, dtype: object

#### 4. What percentage of global sales value on 4 August came from US sellers?

In [224]:
((df_new[(df_new['date']=='2020-08-04')].groupby('seller_country')['total'].sum()) / (df_new[(df_new['date']=='2020-08-04')]['total'].sum()) * 100).tail(1)

seller_country
US    33.271659
Name: total, dtype: float64

In [216]:
((df_new[(df_new['date']=='2020-08-04') & (df_new['seller_country']=='US')]['total'].sum() / df_new[(df_new['date']=='2020-08-04')]['total'].sum()) * 100).round(2)

33.27

In [215]:
df_4Aug = df_new[(df_new['date']=='2020-08-04')].groupby('seller_country')['total'].sum().round(2)
df_4Aug

seller_country
AU      26223.82
CA       6960.54
DE       1486.31
FR        510.88
GB     544079.50
IE      10062.48
IT      27507.79
RoW      7164.97
US     311133.04
Name: total, dtype: float64

#### 5. How many sellers in US has more than 75 sales?

In [250]:
us_sellers = df_new[(df_new['seller_country']=='US')]['seller_id'].value_counts().to_frame()
us_sellers.head()

          seller_id
pzsiehl0        703
wd3rgi3q        525
j21w87xy        500
ucp2k0nu        218
r64zesw6        211

In [251]:
len(us_sellers[us_sellers['seller_id'] > 75])

22

#### 6. Which seller in the US sold the most in terms of value?

In [258]:
df_new[(df_new['seller_country']=='US')].groupby('seller_id')['total'].sum().sort_values(ascending=False)[:1]

seller_id
pzsiehl0    20558.868517
Name: total, dtype: float64

#### 7. Which brand had the largest absolute â‚¬ difference in average transaction value between domestic and international?

In [287]:
df_int = df_new[df_new["buyer_country"] != df_new["seller_country"]]
df_int.head()

,buyer_id,buyer_country,seller_id,seller_country,product_code,category,brand,currency,price,date,rate,total
42,40d0z14olg,DE,3u54hwb8,GB,4wvahn8jbeyx,Other,NaN,GBP,106.86,2020-08-03,0.89935,118.819147
46,idsi2rp3zo,RoW,li8btpfy,GB,jl47yw2ccdjk,Jewellery,NaN,GBP,10.41,2020-08-03,0.89935,11.575026
53,i0jgg0jy9a,IE,u9vc5z3k,GB,yp6t1nbzayca,Bottoms - Womens,NaN,GBP,24.09,2020-08-03,0.89935,26.786012
65,hb40n38s5g,RoW,y2c4v2ov,GB,6li2rxy49gil,Jewellery,NaN,GBP,10.16,2020-08-03,0.89935,11.297048
66,hb40n38s5g,RoW,y2c4v2ov,GB,zl090gp1fdzf,Jewellery,NaN,GBP,10.68,2020-08-03,0.89935,11.875243

In [280]:
len(df_int)

8457

In [285]:
df_dom = df_new[df_new["buyer_country"] == df_new["seller_country"]]
df_dom.head()

,buyer_id,buyer_country,seller_id,seller_country,product_code,category,brand,currency,price,date,rate,total
0,qzpjsi9t0o,GB,6oufpaot,GB,ydecnydr6obf,Dresses,NaN,GBP,19.11,2020-08-03,0.89935,21.248680
1,rd209r8c7c,GB,9p2ansc9,GB,wpxxf59cq7pc,Outerwear - Mens,Adidas Originals,GBP,24.91,2020-08-03,0.89935,27.697782
2,pqbcrl8azx,GB,r9zmzem8,GB,ua9mmn86wsqy,Tops - Womens,NaN,GBP,19.31,2020-08-03,0.89935,21.471062
3,j5en1rwmxp,GB,3o2nz88r,GB,tduo2uy8iszl,Bottoms - Womens,Urban Outfitters,GBP,16.98,2020-08-03,0.89935,18.880302
4,kjdezxeh1l,GB,7g56ublf,GB,39o00tcu89zq,Other,NaN,GBP,2.85,2020-08-03,0.89935,3.168955

In [282]:
len(df_dom)

229214

In [284]:
avg_int_sales = df_int.groupby('brand')['total'].mean().sort_values(ascending=False).to_frame()
avg_int_sales.reset_index(inplace=True)
avg_int_sales.rename({'total': 'avg_int_sales'}, axis=1, inplace=True)
avg_int_sales.head()

         brand  avg_int_sales
0       Goyard     611.456926
1        Loewe     461.082817
2      Needles     314.338133
3       Hermes     267.749153
4  Craig Green     266.792684

In [286]:
avg_dom_sales = df_dom.groupby('brand')['total'].mean().sort_values(ascending=False).to_frame()
avg_dom_sales.reset_index(inplace=True)
avg_dom_sales.rename({'total': 'avg_dom_sales'}, axis=1, inplace=True)
avg_dom_sales.head()

              brand  avg_dom_sales
0         TAG Heuer     224.586782
1      Canada Goose     216.424622
2      Emilio Pucci     214.758636
3  Loeffler Randall     207.720370
4            Goyard     202.661941

In [276]:
avg_sales = pd.merge(avg_int_sales, avg_dom_sales, how = 'inner', on = ["brand"])
avg_sales['sales_diff'] = abs(avg_sales['avg_int_sales'] - avg_sales['avg_dom_sales'])
avg_sales.sort_values(by='sales_diff', ascending=False).head(1)

    brand  avg_int_sales  avg_dom_sales  sales_diff
0  Goyard     611.456926     202.661941  408.794985